RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_usart.c
  /* Initialize the USART state*/
  husart->State= HAL_USART_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(husart);

  return HAL_OK;
}

/**
  * @brief  Simplex send an amount of data in non-blocking mode.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Transmit_IT().
  * @note   The USART errors are not managed to avoid the overrun error.
  * @param husart: USART handle.
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_Transmit_IT(USART_HandleTypeDef *husart)
{
  uint16_t* tmp;

  if(husart->TxXferCount == 0U)
  {
    /* Disable the TX FIFO threshold interrupt (if FIFO mode is enabled) or
       Transmit Data Register Empty interrupt (if FIFO mode is Disabled).
    */
    if (READ_BIT(husart->Instance->CR1, USART_CR1_FIFOEN) != RESET)
    {
      CLEAR_BIT(husart->Instance->CR3, USART_CR3_TXFTIE);
    }
    else
    {
      CLEAR_BIT(husart->Instance->CR1, USART_CR1_TXEIE);
    }

    /* Enable the USART Transmit Complete Interrupt */
    SET_BIT(husart->Instance->CR1, USART_CR1_TCIE);

    return HAL_OK;
  }
  else
  {
    if((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
    {
      tmp = (uint16_t*) husart->pTxBuffPtr;
      husart->Instance->TDR = (*tmp & (uint16_t)0x01FFU);
      husart->pTxBuffPtr += 2U;
    }
    else
    {
      husart->Instance->TDR = (uint8_t)(*husart->pTxBuffPtr++ & (uint8_t)0xFFU);
    }

    husart->TxXferCount--;

    return HAL_OK;
  }
}


/**
  * @brief  Wraps up transmission in non-blocking mode.
  * @param  husart: pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_EndTransmit_IT(USART_HandleTypeDef *husart)
{
  /* Disable the USART Transmit Complete Interrupt */
  CLEAR_BIT(husart->Instance->CR1, USART_CR1_TCIE);

  /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
  CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

  /* Tx process is ended, restore husart->State to Ready */
  husart->State = HAL_USART_STATE_READY;

  HAL_USART_TxCpltCallback(husart);

  return HAL_OK;
}


/**
  * @brief  Simplex receive an amount of data in non-blocking mode.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Receive_IT().
  * @param husart: USART handle
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_Receive_IT(USART_HandleTypeDef *husart)
{
  uint16_t* tmp;
  uint16_t uhMask = husart->Mask;

  if((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
  {
    tmp = (uint16_t*) husart->pRxBuffPtr;
    *tmp = (uint16_t)(husart->Instance->RDR & uhMask);
    husart->pRxBuffPtr += 2U;
  }
  else
  {
    *husart->pRxBuffPtr++ = (uint8_t)(husart->Instance->RDR & (uint8_t)uhMask);
  }

  if (husart->Init.SlaveMode == USART_SLAVEMODE_DISABLE)
  {
    /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
    husart->Instance->TDR = (USART_DUMMY_DATA & (uint16_t)0x00FFU);
  }

  if(--husart->RxXferCount == 0U)
  {
    /* Disable the USART Parity Error Interrupt and RXNE interrupt*/
    CLEAR_BIT(husart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));

    /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* Rx process is completed, restore husart->State to Ready */
    husart->State = HAL_USART_STATE_READY;

    HAL_USART_RxCpltCallback(husart);

    return HAL_OK;
  }

  return HAL_OK;
}

/**
  * @brief  Full-Duplex Send receive an amount of data in full-duplex mode (non-blocking).
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_TransmitReceive_IT().
  * @param husart: USART handle.
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_TransmitReceive_IT(USART_HandleTypeDef *husart)
{
  uint16_t* tmp;
  uint16_t uhMask = husart->Mask;

  if(husart->TxXferCount != 0x00U)
  {
    if(__HAL_USART_GET_FLAG(husart, USART_FLAG_TXE) != RESET)
    {
      if((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
      {
        tmp = (uint16_t*) husart->pTxBuffPtr;
        husart->Instance->TDR = (uint16_t)(*tmp & uhMask);
        husart->pTxBuffPtr += 2U;
      }
      else
      {
        husart->Instance->TDR = (uint8_t)(*husart->pTxBuffPtr++ & (uint8_t)uhMask);
      }
      husart->TxXferCount--;

      /* Check the latest data transmitted */
      if(husart->TxXferCount == 0U)
      {
        /* Disable the TX FIFO threshold interrupt (if FIFO mode is enabled) or
           Transmit Data Register Empty interrupt (if FIFO mode is Disabled) */
        if (READ_BIT(husart->Instance->CR1, USART_CR1_FIFOEN) != RESET)
        {
          CLEAR_BIT(husart->Instance->CR3, USART_CR3_TXFTIE);
        }
        else
        {
          CLEAR_BIT(husart->Instance->CR1, USART_CR1_TXEIE);
        }
      }
    }
  }

  if(husart->RxXferCount != 0x00U)
  {
    if(__HAL_USART_GET_FLAG(husart, USART_FLAG_RXNE) != RESET)
    {
      if((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
      {
        tmp = (uint16_t*) husart->pRxBuffPtr;
        *tmp = (uint16_t)(husart->Instance->RDR & uhMask);
        husart->pRxBuffPtr += 2U;
      }
      else
      {
        *husart->pRxBuffPtr++ = (uint8_t)(husart->Instance->RDR & (uint8_t)uhMask);
      }
      husart->RxXferCount--;
    }
  }

  /* Check the latest data received */
  if(husart->RxXferCount == 0U)
  {
    /* Disable the USART Parity Error Interrupt and RXNE interrupt*/
    CLEAR_BIT(husart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));

    /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* Rx process is completed, restore husart->State to Ready */
    husart->State = HAL_USART_STATE_READY;

    HAL_USART_TxRxCpltCallback(husart);

    return HAL_OK;
  }

  return HAL_OK;
}

/**
  * @}
  */

#endif /* HAL_USART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
